Masmiseim36/nxpSDK/boards/frdmk82f/demo_apps/ecompass_peripheral/pin_mux.h
/*
 * Copyright 2019 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*! @name PORTC14 (number 86), DEBUG_UART_RX
  @{ */
#define BOARD_DEBUG_UART_RX_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_DEBUG_UART_RX_PIN 14U    /*!<@brief PORTC pin index: 14 */
                                       /* @} */

/*! @name PORTC15 (number 87), DEBUG_UART_TX
  @{ */
#define BOARD_DEBUG_UART_TX_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_DEBUG_UART_TX_PIN 15U    /*!<@brief PORTC pin index: 15 */
                                       /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

/*! @name PORTA1 (number 37), ACCEL_SDA
  @{ */
#define BOARD_I2C_ACCEL_SDA_PORT PORTA /*!<@brief PORT device name: PORTA */
#define BOARD_I2C_ACCEL_SDA_PIN 1U     /*!<@brief PORTA pin index: 1 */
                                       /* @} */

/*! @name PORTA2 (number 38), ACCEL_SCL
  @{ */
#define BOARD_I2C_ACCEL_SCL_PORT PORTA /*!<@brief PORT device name: PORTA */
#define BOARD_I2C_ACCEL_SCL_PIN 2U     /*!<@brief PORTA pin index: 2 */
                                       /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_I2C_ConfigurePins(void);

/*! @name PORTA1 (number 37), ACCEL_SDA
  @{ */
#define BOARD_GPIO_ACCEL_SDA_GPIO GPIOA /*!<@brief GPIO device name: GPIOA */
#define BOARD_GPIO_ACCEL_SDA_PORT PORTA /*!<@brief PORT device name: PORTA */
#define BOARD_GPIO_ACCEL_SDA_PIN 1U     /*!<@brief PORTA pin index: 1 */
                                        /* @} */

/*! @name PORTA2 (number 38), ACCEL_SCL
  @{ */
#define BOARD_GPIO_ACCEL_SCL_GPIO GPIOA /*!<@brief GPIO device name: GPIOA */
#define BOARD_GPIO_ACCEL_SCL_PORT PORTA /*!<@brief PORT device name: PORTA */
#define BOARD_GPIO_ACCEL_SCL_PIN 2U     /*!<@brief PORTA pin index: 2 */
                                        /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_GPIO_ConfigurePins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
